# Домашнее задание 2 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [59]:
import pandas as pd
import glob
import numpy as np

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [60]:
file_list = glob.glob('Data'+ "/*.csv")
df_00, df_01 = pd.DataFrame(pd.read_csv(file_list[0])), pd.DataFrame(pd.read_csv(file_list[1]))
main_df = pd.merge(df_00,df_01, on ='index')
for i in range(2,len(file_list)-1,2):
   df1, df2 = pd.DataFrame(pd.read_csv(file_list[i])), pd.DataFrame(pd.read_csv(file_list[i+1]))
   side_df = pd.merge(df1,df2, on ='index')
   main_df = pd.concat([main_df, side_df])
df = main_df.sort_values(by="index")
df.head()

,index,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,1,69,90,88,female,group C,some college,standard,completed,group1
2,2,90,95,93,female,group B,master's degree,standard,none,group1
3,3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,4,76,78,75,male,group C,some college,standard,none,group1

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [61]:
del df["index"]
df[:10]

,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,69,90,88,female,group C,some college,standard,completed,group1
2,90,95,93,female,group B,master's degree,standard,none,group1
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,76,78,75,male,group C,some college,standard,none,group1
5,71,83,78,female,group B,associate's degree,standard,none,group1
6,88,95,92,female,group B,some college,standard,completed,group1
7,40,43,39,male,group B,some college,free/reduced,none,group1
8,64,64,67,male,group D,high school,free/reduced,completed,group1
9,38,60,50,female,group B,high school,free/reduced,none,group1

#### Задание 3. Выведите на экран размеры полученной таблицы

In [62]:
print(df.size, ',',len(df), 'x', len(df.columns))

9000 , 1000 x 9

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [63]:
a = df.describe()
pd.concat([a[1:4],a.tail(1)])

      math score  reading score  writing score
mean    66.08900      69.169000      68.054000
std     15.16308      14.600192      15.195657
min      0.00000      17.000000      10.000000
max    100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [64]:
df.isnull().any().any()

False

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [65]:
a[1:2]

      math score  reading score  writing score
mean      66.089         69.169         68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [66]:
df_true = df[df["test preparation course"] == "completed"]
df_false = df[df["test preparation course"] != "completed"]
print(df_true.mean())
print(df_false.mean())

math score       69.695531
reading score    73.893855
writing score    74.418994
dtype: float64
math score       64.077882
reading score    66.534268
writing score    64.504673
dtype: float64

/var/folders/7b/_0j65qyd6_l801khvk_jh2yh0000gn/T/ipykernel_18041/535956169.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df_true.mean())
/var/folders/7b/_0j65qyd6_l801khvk_jh2yh0000gn/T/ipykernel_18041/535956169.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df_false.mean())

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [67]:
df["lunch"].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [68]:
df = df.rename(columns={"parental level of education":"education","test preparation course":"test preparation"})

**Зафиксируем минимальный балл для сдачи экзамена**

In [69]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [70]:
#1 
print(len(df[df["math score"] >= passmark])/len(df))
#2
print(len(df_true[df_true["math score"] >= passmark])/len(df_true))
#3
fem = df_false[df_false["gender"] == "female"]
print(len(fem[fem["math score"] < passmark])/len(fem))

0.865
0.9217877094972067
0.20958083832335328

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [71]:
%%time
print(df.groupby(["race/ethnicity"])["reading score"].mean())
print(df.groupby(["education"])["writing score"].min())

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
CPU times: user 4.6 ms, sys: 1.69 ms, total: 6.29 ms
Wall time: 4.75 ms

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [72]:
%%time
azbuka = ['A', 'B', 'C', 'D','E'] # cпособ не оч хороший, но суть задания в циклах, в любом случае, если групп будет больше я смогу достать все группы с помощью unique
for j in range(len(azbuka)):
    c = np.array(df[df["race/ethnicity"] == ('group ' + azbuka[j])]["reading score"])
    sum = 0
    for i in range(0,len(c)):
        sum += c[i]
    print('group', azbuka[j], sum/len(c))


educat = df["education"].unique()
for j in range(len(educat)-1):
    b = np.array(df[df["education"] == educat[j]]["writing score"])
    for i in range(len(b)-1):
        for k in range(len(b)-i-1):
            if b[k] >= b[k+1]:
               t = b[k]
               b[k] = b[k+1] # почему b[k], b[k+1] = b[k+1], b[k] выдает ошибку?
               b[k+1] = t
    print(educat[j], ':', b[0])

group A 64.67415730337079
group B 67.35263157894737
group C 69.10344827586206
group D 70.03053435114504
group E 73.02857142857142
bachelor's degree : 38
some college : 19
master's degree : 46
associate's degree : 35
high school : 15
CPU times: user 71.7 ms, sys: 3.21 ms, total: 74.9 ms
Wall time: 72.8 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [73]:
pd.pivot_table(df, index =['gender','education'])

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [74]:
df['Math_PassStatus'] = np.where(df["math score"] >= passmark, 'P', 'F')
df['Reading_PassStatus'] = np.where(df["reading score"] >= passmark, 'P', 'F')
df['Writing_PassStatus'] = np.where(df["writing score"] >= passmark, 'P', 'F')
df.head(6)

,math score,reading score,writing score,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
0,72,72,74,female,group B,bachelor's degree,standard,none,group1,P,P,P
1,69,90,88,female,group C,some college,standard,completed,group1,P,P,P
2,90,95,93,female,group B,master's degree,standard,none,group1,P,P,P
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1,F,P,F
4,76,78,75,male,group C,some college,standard,none,group1,P,P,P
5,71,83,78,female,group B,associate's degree,standard,none,group1,P,P,P

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [75]:
df['OverAll_PassStatus'] = np.where((df["Math_PassStatus"] =='P') & (df["Reading_PassStatus"] == 'P') & (df["Writing_PassStatus"] == 'P'), 'P', 'F')
df.head(6)

,math score,reading score,writing score,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus
0,72,72,74,female,group B,bachelor's degree,standard,none,group1,P,P,P,P
1,69,90,88,female,group C,some college,standard,completed,group1,P,P,P,P
2,90,95,93,female,group B,master's degree,standard,none,group1,P,P,P,P
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1,F,P,F,F
4,76,78,75,male,group C,some college,standard,none,group1,P,P,P,P
5,71,83,78,female,group B,associate's degree,standard,none,group1,P,P,P,P

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [76]:
def GetGrade(average_mark):
    average_mark = np.where(average_mark >= 90, 'A',
                                                     np.where(average_mark >=80, 'B', 
                                                                                     np.where(average_mark >=70, 'C',
                                                                                                                    np.where(average_mark >=60, 'D',
                                                                                                                                                    np.where(average_mark >= 50, 'E',
                                                                                                                                                                                    np.where(average_mark<50, 'F', 'E')
                                                                                                                                                             )
                                                                                                                                )
                                                                                                )
                                                                )
                                                     
                                )       

    return average_mark
    
df['Grade'] = GetGrade(df.mean(axis = 1))
a = df['Grade'].tolist()
print('A:', a.count('A'), 
                        'B:', a.count('B'), 
                                            'C:', a.count('C'),
                                                                'D:', a.count('D'), 
                                                                                    'E:', a.count('E'),
                                                                                                        'F:', a.count('F')
        )

A: 52 B: 146 C: 261 D: 256 E: 182 F: 103

/var/folders/7b/_0j65qyd6_l801khvk_jh2yh0000gn/T/ipykernel_18041/2807759732.py:17: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['Grade'] = GetGrade(df.mean(axis = 1))